# FormulaEditingEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormulaEditingEventArgs Class
Members See Also
---
The event arguments used by the DocumentSaving event.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class FormulaEditingEventArgs : RevitAPIPreEventArgs
```

Visual Basic
---
```text
Public Class FormulaEditingEventArgs _
	Inherits RevitAPIPreEventArgs
```

Visual C++
---
```text
public ref class FormulaEditingEventArgs : public RevitAPIPreEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreEventArgs Autodesk.Revit.UI.Events..::..FormulaEditingEventArgs
# See Also
FormulaEditingEventArgs Members
Autodesk.Revit.UI.Events Namespace